#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan (dev) 📖`failure`

<details><summary>Show Plan</summary>

```

data.aws_route53_zone.main_domain[0]: Reading...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.app_certificate[0] will be created
  + resource "aws_acm_certificate" "app_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "dev-nextjs.stansk.com"
      + domain_validation_options = [
          + {
              + domain_name           = "dev-nextjs.stansk.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "dev-nextjs.stansk.com",
        ]
      + tags                      = {
          + "Environment" = "dev"
          + "Name"        = "dev-react-formation-certificate"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-react-formation-certificate"
          + "Project"     = "react-formation"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_cloudfront_cache_policy.app_cache_policy will be created
  + resource "aws_cloudfront_cache_policy" "app_cache_policy" {
      + arn         = (known after apply)
      + comment     = "Cache policy for react-formation dev"
      + default_ttl = 86400
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 31536000
      + min_ttl     = 1
      + name        = "dev-react-formation-cache-policy"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "none"
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # aws_cloudfront_origin_access_control.app_oac will be created
  + resource "aws_cloudfront_origin_access_control" "app_oac" {
      + arn                               = (known after apply)
      + description                       = "OAC pour l'accès au bucket S3"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "dev-react-formation-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_cloudfront_origin_request_policy.app_request_policy will be created
  + resource "aws_cloudfront_origin_request_policy" "app_request_policy" {
      + arn     = (known after apply)
      + comment = "Request policy for react-formation dev"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "dev-react-formation-request-policy"

      + cookies_config {
          + cookie_behavior = "none"
        }

      + headers_config {
          + header_behavior = "whitelist"

          + headers {
              + items = [
                  + "Access-Control-Request-Headers",
                  + "Access-Control-Request-Method",
                  + "Origin",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # aws_s3_bucket.app_bucket will be created
  + resource "aws_s3_bucket" "app_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-react-formation-app-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "dev-app-bucket"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-app-bucket"
          + "Project"     = "react-formation"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_versioning.app_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "app_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_website_configuration.app_website will be created
  + resource "aws_s3_bucket_website_configuration" "app_website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_bucket_arn  = (known after apply)
  + app_bucket_name = "dev-react-formation-app-bucket"
  + domain_name     = "dev-nextjs.stansk.com"
  + environment     = "dev"
  + iam_policy_json = jsonencode(
        {
          + Statement = [
              + {
                  + Action   = [
                      + "s3:ListBucket",
                      + "s3:GetObject",
                      + "s3:PutObject",
                      + "s3:DeleteObject",
                    ]
                  + Effect   = "Allow"
                  + Resource = [
                      + "arn:aws:s3:::dev-react-formation-terraform-state",
                      + "arn:aws:s3:::dev-react-formation-terraform-state/*",
                      + "arn:aws:s3:::prod-react-formation-terraform-state",
                      + "arn:aws:s3:::prod-react-formation-terraform-state/*",
                    ]
                },
              + {
                  + Action   = [
                      + "s3:CreateBucket",
                      + "s3:DeleteBucket",
                      + "s3:GetBucketVersioning",
                      + "s3:PutBucketVersioning",
                      + "s3:GetBucketPolicy",
                      + "s3:PutBucketPolicy",
                      + "s3:GetBucketWebsite",
                      + "s3:PutBucketWebsite",
                      + "s3:GetBucketTagging",
                      + "s3:PutBucketTagging",
                      + "s3:ListBucket",
                      + "s3:GetObject",
                      + "s3:PutObject",
                      + "s3:DeleteObject",
                      + "s3:PutBucketCORS",
                      + "s3:GetBucketCORS",
                    ]
                  + Effect   = "Allow"
                  + Resource = [
                      + "arn:aws:s3:::dev-react-formation-app-bucket",
                      + "arn:aws:s3:::dev-react-formation-app-bucket/*",
                      + "arn:aws:s3:::prod-react-formation-app-bucket",
                      + "arn:aws:s3:::prod-react-formation-app-bucket/*",
                    ]
                },
              + {
                  + Action   = [
                      + "cloudfront:CreateDistribution",
                      + "cloudfront:UpdateDistribution",
                      + "cloudfront:DeleteDistribution",
                      + "cloudfront:GetDistribution",
                      + "cloudfront:ListDistributions",
                      + "cloudfront:CreateCloudFrontOriginAccessIdentity",
                      + "cloudfront:GetCloudFrontOriginAccessIdentity",
                      + "cloudfront:DeleteCloudFrontOriginAccessIdentity",
                      + "cloudfront:CreateInvalidation",
                      + "cloudfront:GetInvalidation",
                      + "cloudfront:ListInvalidations",
                      + "cloudfront:CreateCachePolicy",
                      + "cloudfront:GetCachePolicy",
                      + "cloudfront:UpdateCachePolicy",
                      + "cloudfront:DeleteCachePolicy",
                      + "cloudfront:CreateOriginRequestPolicy",
                      + "cloudfront:GetOriginRequestPolicy",
                      + "cloudfront:UpdateOriginRequestPolicy",
                      + "cloudfront:DeleteOriginRequestPolicy",
                      + "cloudfront:CreateOriginAccessControl",
                      + "cloudfront:GetOriginAccessControl",
                      + "cloudfront:UpdateOriginAccessControl",
                      + "cloudfront:DeleteOriginAccessControl",
                    ]
                  + Effect   = "Allow"
                  + Resource = "*"
                },
              + {
                  + Action   = [
                      + "acm:RequestCertificate",
                      + "acm:DescribeCertificate",
                      + "acm:DeleteCertificate",
                      + "acm:ListCertificates",
                      + "acm:AddTagsToCertificate",
                    ]
                  + Effect   = "Allow"
                  + Resource = "*"
                },
              + {
                  + Action   = [
                      + "route53:ListHostedZones",
                      + "route53:GetHostedZone",
                      + "route53:ListResourceRecordSets",
                      + "route53:ChangeResourceRecordSets",
                      + "route53:CreateHealthCheck",
                      + "route53:GetHealthCheck",
                      + "route53:DeleteHealthCheck",
                      + "route53:UpdateHealthCheck",
                      + "route53:GetChange",
                    ]
                  + Effect   = "Allow"
                  + Resource = "*"
                },
            ]
          + Version   = "2012-10-17"
        }
    )

```

</details>
